---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileWriteOptions.FileFormat
source: html/21e98bbb-51f7-f9ad-8a33-b369c5f85c2a.htm
---
# Autodesk.Revit.DB.IFC.IFCFileWriteOptions.FileFormat Property

The file format of the IFC file.

## Syntax (C#)
```csharp
public IFCFileFormat FileFormat { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration